JingyiWu-codespace/IoT_HeartRateMonitor_WebApplication/PSOC_PPG.cydsn/Generated_Source/PSoC6/I2C_BUS.h
/***************************************
*    In-line Function Implementation
***************************************/

/*******************************************************************************
* Function Name: I2C_BUS_Init
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_Init() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE cy_en_scb_i2c_status_t I2C_BUS_Init(cy_stc_scb_i2c_config_t const *config)
{
    return Cy_SCB_I2C_Init(I2C_BUS_HW, config, &I2C_BUS_context);
}


/*******************************************************************************
*  Function Name: I2C_BUS_DeInit
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_DeInit() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_BUS_DeInit(void)
{
    Cy_SCB_I2C_DeInit(I2C_BUS_HW);
}


/*******************************************************************************
* Function Name: I2C_BUS_Enable
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_Enable() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_BUS_Enable(void)
{
    Cy_SCB_I2C_Enable(I2C_BUS_HW);
}


/*******************************************************************************
* Function Name: I2C_BUS_Disable
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_Disable() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_BUS_Disable(void)
{
    Cy_SCB_I2C_Disable(I2C_BUS_HW, &I2C_BUS_context);
}


/*******************************************************************************
* Function Name: I2C_BUS_SetDataRate
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SetDataRate() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_BUS_SetDataRate(uint32_t dataRateHz, uint32_t scbClockHz)
{
    return Cy_SCB_I2C_SetDataRate(I2C_BUS_HW, dataRateHz, scbClockHz);
}


/*******************************************************************************
* Function Name: I2C_BUS_GetDataRate
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_GetDataRate() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_BUS_GetDataRate(uint32_t scbClockHz)
{
    return Cy_SCB_I2C_GetDataRate(I2C_BUS_HW, scbClockHz);
}


/*******************************************************************************
* Function Name: I2C_BUS_RegisterEventCallback
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_RegisterEventCallback() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_BUS_RegisterEventCallback(cy_cb_scb_i2c_handle_events_t callback)
{
    Cy_SCB_I2C_RegisterEventCallback(I2C_BUS_HW, callback, &I2C_BUS_context);
}


#if (I2C_BUS_ENABLE_SLAVE)
/*******************************************************************************
* Function Name: I2C_BUS_RegisterAddrCallback
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_RegisterAddrCallback() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_BUS_RegisterAddrCallback(cy_cb_scb_i2c_handle_addr_t callback)
{
    Cy_SCB_I2C_RegisterAddrCallback(I2C_BUS_HW, callback, &I2C_BUS_context);
}
#endif /* (I2C_BUS_ENABLE_SLAVE) */


/*******************************************************************************
* Function Name: I2C_BUS_IsBusBusy
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_IsBusBusy() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE bool I2C_BUS_IsBusBusy(void)
{
    return Cy_SCB_I2C_IsBusBusy(I2C_BUS_HW);
}


#if (I2C_BUS_ENABLE_SLAVE)
/*******************************************************************************
* Function Name: I2C_BUS_SlaveSetAddress
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveGetAddress() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_BUS_SlaveSetAddress(uint8_t addr)
{
    Cy_SCB_I2C_SlaveSetAddress(I2C_BUS_HW, addr);
}


/*******************************************************************************
* Function Name: I2C_BUS_SlaveGetAddress
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveGetAddress() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE uint32_t I2C_BUS_SlaveGetAddress(void)
{
    return Cy_SCB_I2C_SlaveGetAddress(I2C_BUS_HW);
}


/*******************************************************************************
* Function Name: I2C_BUS_SlaveSetAddressMask
****************************************************************************//**
*
* Invokes the Cy_SCB_I2C_SlaveSetAddressMask() PDL driver function.
*
*******************************************************************************/
__STATIC_INLINE void I2C_BUS_SlaveSetAddressMask(uint8_t addrMask)
{
    Cy_SCB_I2C_SlaveSetAddressMask(I2C_BUS_HW, addrMask);
}


